rtkconnectivity/hal_realtek_mainline/zephyr/blobs/bee/rtl87x2j/bin/flash_map.h
/**
*****************************************************************************************
*     Copyright(c) 2025, Realtek Semiconductor Corporation. All rights reserved.
*****************************************************************************************
* @file    flash_map.h
* @brief   Flash Layout Configuration, and flash layout must be changed with config file!
* @note    flash_map.h must be generated by FlashMapGenerateTool!
* *************************************************************************************
*/

#ifndef _FLASH_MAP_H_
#define _FLASH_MAP_H_

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
*                        Flash Layout
*============================================================================*/
/*  Flash total size                                976KB
MMU enable
example:
	1) Boot Patch:                                       75K (0x02000000)
	2) OTA Bank0:                                       645K (0x02012C00)
		a) OTA Header                    1K (0x02012C00)
		b) Sys Patch                    24K (0x02013000)
		c) BT Controller               217K (0x02019000)
		d) BT Host                       0K (0x0204F400)
		e) APP code                    403K (0x0204F400)
		f) APP data1                     0K (0x020B4000)
		g) APP data2                     0K (0x020B4000)
		h) APP data3                     0K (0x020B4000)
		i) APP data4                     0K (0x020B4000)
		j) APP data5                     0K (0x020B4000)
		k) APP config data               0K (0x020B4000)
	3) OTA Bank1:                                         0K (0x03000000)
		a) OTA Header                    0K (0x00000000)
		b) Sys Patch                     0K (0x00000000)
		c) BT Controller                 0K (0x00000000)
		d) BT Host                       0K (0x00000000)
		e) APP code                      0K (0x00000000)
		f) APP data1                     0K (0x00000000)
		g) APP data2                     0K (0x00000000)
		h) APP data3                     0K (0x00000000)
		i) APP data4                     0K (0x00000000)
		j) APP data5                     0K (0x00000000)
		k) APP config data               0K (0x00000000)
	4) OTA Tmp:                                           4K (0x03000000)
	5) APP Defined Section1:                              0K (0x03001000)
	6) APP Defined Section2:                              0K (0x03001000)
*/

/*============================================================================*
*            Flash Layout Configuration (Generated by FlashMapGenerateTool)
*============================================================================*/

#define MMU_ENABLE                          1  
#define FLASH_START_ADDR                    0x02000000  //Fixed
#define FLASH_MAX_SIZE                      0x000F4000  //976K Bytes

/* ========== High Level Flash Layout Configuration ========== */
#define BOOT_PATCH_ADDR                     0x02000000
#define BOOT_PATCH_SIZE                     0x00012C00  //75K Bytes
#define OTA_BANK0_ADDR                      0x02012C00
#define OTA_BANK0_SIZE                      0x000A1400  //645K Bytes
#define OTA_BANK1_ADDR                      0x03000000
#define OTA_BANK1_SIZE                      0x00000000  //0K Bytes
#define OTA_TMP_ADDR                        0x03000000
#define OTA_TMP_SIZE                        0x00001000  //4K Bytes
#define BKP_DATA1_ADDR                      0x03001000
#define BKP_DATA1_SIZE                      0x00000000  //0K Bytes
#define BKP_DATA2_ADDR                      0x03001000
#define BKP_DATA2_SIZE                      0x00000000  //0K Bytes

/* ========== OTA Bank0 Flash Layout Configuration ========== */
#define BANK0_OTA_HEADER_ADDR               0x02012C00
#define BANK0_OTA_HEADER_SIZE               0x00000400  //1K Bytes
#define BANK0_SYS_PATCH_ADDR                0x02013000
#define BANK0_SYS_PATCH_EXE_ADDR            0x02C00000                          
#define BANK0_SYS_PATCH_SIZE                0x00006000  //24K Bytes
#define BANK0_BT_CONTROLLER_ADDR            0x02019000
#define BANK0_BT_CONTROLLER_EXE_ADDR        0x02C40000                          
#define BANK0_BT_CONTROLLER_SIZE            0x00036400  //217K Bytes
#define BANK0_BT_HOST_ADDR                  0x0204F400
#define BANK0_BT_HOST_SIZE                  0x00000000  //0K Bytes
#define BANK0_APP_ADDR                      0x0204F400
#define BANK0_APP_SIZE                      0x00064C00  //403K Bytes
#define BANK0_APP_DATA1_ADDR                0x020B4000
#define BANK0_APP_DATA1_SIZE                0x00000000  //0K Bytes
#define BANK0_APP_DATA2_ADDR                0x020B4000
#define BANK0_APP_DATA2_SIZE                0x00000000  //0K Bytes
#define BANK0_APP_DATA3_ADDR                0x020B4000
#define BANK0_APP_DATA3_SIZE                0x00000000  //0K Bytes
#define BANK0_APP_DATA4_ADDR                0x020B4000
#define BANK0_APP_DATA4_SIZE                0x00000000  //0K Bytes
#define BANK0_APP_DATA5_ADDR                0x020B4000
#define BANK0_APP_DATA5_SIZE                0x00000000  //0K Bytes
#define BANK0_APP_CFG_DATA_ADDR             0x020B4000
#define BANK0_APP_CFG_DATA_SIZE             0x00000000  //0K Bytes

/* ========== OTA Bank1 Flash Layout Configuration ========== */
#define BANK1_OTA_HEADER_ADDR               0x00000000
#define BANK1_OTA_HEADER_SIZE               0x00000000  //0K Bytes
#define BANK1_SYS_PATCH_ADDR                0x00000000
#define BANK1_SYS_PATCH_SIZE                0x00000000  //0K Bytes
#define BANK1_BT_CONTROLLER_ADDR            0x00000000
#define BANK1_BT_CONTROLLER_SIZE            0x00000000  //0K Bytes
#define BANK1_BT_HOST_ADDR                  0x00000000
#define BANK1_BT_HOST_SIZE                  0x00000000  //0K Bytes
#define BANK1_APP_ADDR                      0x00000000
#define BANK1_APP_SIZE                      0x00000000  //0K Bytes
#define BANK1_APP_DATA1_ADDR                0x00000000
#define BANK1_APP_DATA1_SIZE                0x00000000  //0K Bytes
#define BANK1_APP_DATA2_ADDR                0x00000000
#define BANK1_APP_DATA2_SIZE                0x00000000  //0K Bytes
#define BANK1_APP_DATA3_ADDR                0x00000000
#define BANK1_APP_DATA3_SIZE                0x00000000  //0K Bytes
#define BANK1_APP_DATA4_ADDR                0x00000000
#define BANK1_APP_DATA4_SIZE                0x00000000  //0K Bytes
#define BANK1_APP_DATA5_ADDR                0x00000000
#define BANK1_APP_DATA5_SIZE                0x00000000  //0K Bytes
#define BANK1_APP_CFG_DATA_ADDR             0x00000000
#define BANK1_APP_CFG_DATA_SIZE             0x00000000  //0K Bytes


#ifdef __cplusplus
}
#endif
/** @} */ /* _FLASH_MAP_H_ */
#endif
